Revit 2027 API
AdvancedWood.WoodLatecolorPerlinEnable Property
 The property labeled "Use perlin noise for latewood color" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodLatecolorPerlinEnable { get; }
Public Shared ReadOnly Property WoodLatecolorPerlinEnable As String
	Get
public:
static property String^ WoodLatecolorPerlinEnable {
	String^ get ();
}
static member WoodLatecolorPerlinEnable : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace